STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE/BLE_DataThroughput_Client/STM32_WPAN/App/app_ble.c
static void BleStack_Process_BG(void)
{
  if (BleStack_Process( ) == 0x0)
  {
    BleStackCB_Process( );
  }
}

static void gap_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}

static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}

/**
  * @brief  Notify the LL to resume the flow process
  * @param  None
  * @retval None
  */
static void BLE_ResumeFlowProcessCallback(void)
{
  /* Receive any events from the LL. */
  change_state_options_t notify_options;

  notify_options.combined_value = 0x0F;

  ll_intf_chng_evnt_hndlr_state( notify_options );
}

static void BLE_NvmCallback(SNVMA_Callback_Status_t CbkStatus)
{
  if (CbkStatus != SNVMA_OPERATION_COMPLETE)
  {
    /* Retry the write operation */
    SNVMA_Write (APP_BLE_NvmBuffer, BLE_NvmCallback);
  }
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */
static void Connect_Request(void)
{
  tBleStatus result;
  uint8_t device_index;

  for (device_index = 0 ; device_index < P2P_DEVICE_COUNT_MAX; device_index++)
  {
    if (bleAppContext.deviceServerFound != 0)
    {
      LOG_INFO_APP("Create connection to P2Pserver index %d\n",device_index);

      result = aci_gap_create_connection(SCAN_INT_MS(500u), SCAN_WIN_MS(500u),
                                         bleAppContext.a_deviceServerBdAddrType,
                                         &bleAppContext.a_deviceServerBdAddr[0],
                                         CFG_BD_ADDRESS_TYPE,
                                         CONN_INT_MS(7.5), CONN_INT_MS(7.5),
                                         0u,
                                         CONN_SUP_TIMEOUT_MS(5000u),
                                         CONN_CE_LENGTH_MS(0u), CONN_CE_LENGTH_MS(50u));
      if (result == BLE_STATUS_SUCCESS)
      {
        bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
        LOG_INFO_APP("  wait for event HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE\n");
        UTIL_SEQ_WaitEvt(1u << CFG_IDLEEVT_CONNECTION_COMPLETE);

      }
      else
      {
        LOG_INFO_APP("==>> GAP Create connection Failed , result: 0x%02X\n", result);
        #if (CFG_LED_SUPPORTED == 1)
        BSP_LED_On(LED_RED);
        #endif
        bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
      }
    }
  }
  return;
}

static void Scan_Request(void)
{
  tBleStatus result;
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    #if (CFG_LED_SUPPORTED == 1)
    BSP_LED_On(LED_BLUE);
    #endif

    result = aci_gap_start_general_discovery_proc(SCAN_INT_MS(500u), SCAN_WIN_MS(500u), CFG_BD_ADDRESS_TYPE, 1);
    if (result == BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  ** START GENERAL DISCOVERY (SCAN) **\n");
    }
    else
    {
      #if (CFG_LED_SUPPORTED == 1)
      BSP_LED_On(LED_RED);
      #endif
      LOG_INFO_APP("-- BLE_App_Start_Limited_Disc_Req, Failed 0x%02X\n", result);
    }
  }
  BleStackCB_Process();
  return;
}

static void Connection_Update( void )
{
  tBleStatus result;
  LOG_INFO_APP("  ** CONNECTION UPDATE **\n");

  result = aci_gap_start_connection_update(bleAppContext.connectionHandle,
                                           CONN_INT_MS(50),
                                           CONN_INT_MS(50),
                                           0, 0x3e8, 0x0000, 0x0280);
  if (result != BLE_STATUS_SUCCESS)
  {
    #if (CFG_LED_SUPPORTED == 1)
    BSP_LED_On(LED_RED);
    #endif
  }
  BleStackCB_Process();
  return;
}

static uint8_t analyse_adv_report(hci_le_advertising_report_event_rp0 *p_adv_report)
{
  uint8_t adv_type = 0, adv_data_size, found_status;
  uint8_t *p_adv_data;
  uint16_t i = 0;

  found_status = 0;
  adv_type = p_adv_report->Advertising_Report[0].Event_Type;
  adv_data_size = p_adv_report->Advertising_Report[0].Length_Data;

  if (adv_type == HCI_ADV_EVT_TYPE_ADV_IND)
  {
    uint8_t ad_length, ad_type;
    p_adv_data = (uint8_t*)(&p_adv_report->Advertising_Report[0].Length_Data) + 1;

    while(i < adv_data_size)
    {
      ad_length = p_adv_data[i];
      ad_type = p_adv_data[i + 1];

      switch (ad_type)
      {
        case AD_TYPE_FLAGS:
          break;

        case AD_TYPE_TX_POWER_LEVEL:
          break;

        case AD_TYPE_MANUFACTURER_SPECIFIC_DATA:
          if ((ad_length >= 7) && (p_adv_data[i + 4] == 0x02))
          {
            LOG_INFO_APP("--- ST MANUFACTURER data BlueSTv2\n");
            if(p_adv_data[i + 6] == FW_ID_DT_SERVER)
            {
              bleAppContext.a_deviceServerBdAddr[0] = p_adv_report->Advertising_Report[0].Address[0];
              bleAppContext.a_deviceServerBdAddr[1] = p_adv_report->Advertising_Report[0].Address[1];
              bleAppContext.a_deviceServerBdAddr[2] = p_adv_report->Advertising_Report[0].Address[2];
              bleAppContext.a_deviceServerBdAddr[3] = p_adv_report->Advertising_Report[0].Address[3];
              bleAppContext.a_deviceServerBdAddr[4] = p_adv_report->Advertising_Report[0].Address[4];
              bleAppContext.a_deviceServerBdAddr[5] = p_adv_report->Advertising_Report[0].Address[5];
              bleAppContext.a_deviceServerBdAddrType = p_adv_report->Advertising_Report[0].Address_Type;

              bleAppContext.deviceServerFound = 0x01;

              LOG_INFO_APP("-- DT server detected, db addr 0x%02X:%02X:%02X:%02X:%02X:%02X\n",
                              bleAppContext.a_deviceServerBdAddr[5],
                              bleAppContext.a_deviceServerBdAddr[4],
                              bleAppContext.a_deviceServerBdAddr[3],
                              bleAppContext.a_deviceServerBdAddr[2],
                              bleAppContext.a_deviceServerBdAddr[1],
                              bleAppContext.a_deviceServerBdAddr[0]);
              found_status = 1;
            }
            else
            {
              LOG_INFO_APP("-- DT server not detected\n");
            }
          }
          else if ((ad_length >= 7) && (p_adv_data[i + 2] == 0x01))
          {
            LOG_INFO_APP("--- ST MANUFACTURER data BlueSTv1\n");
            if(p_adv_data[i + 3] == FW_ID_DT_SERVER)
            {
              bleAppContext.a_deviceServerBdAddr[0] = p_adv_report->Advertising_Report[0].Address[0];
              bleAppContext.a_deviceServerBdAddr[1] = p_adv_report->Advertising_Report[0].Address[1];
              bleAppContext.a_deviceServerBdAddr[2] = p_adv_report->Advertising_Report[0].Address[2];
              bleAppContext.a_deviceServerBdAddr[3] = p_adv_report->Advertising_Report[0].Address[3];
              bleAppContext.a_deviceServerBdAddr[4] = p_adv_report->Advertising_Report[0].Address[4];
              bleAppContext.a_deviceServerBdAddr[5] = p_adv_report->Advertising_Report[0].Address[5];
              bleAppContext.a_deviceServerBdAddrType = p_adv_report->Advertising_Report[0].Address_Type;

